spec details
